{
  "id": "trade-secrets-nn-54-18",
  "type": "statute",
  "title": "Zakon o zaštiti neobjavljenih informacija s tržišnom vrijednosti",
  "title_en": "Trade Secrets Act",
  "short_name": "Trade Secrets Act",
  "status": "in_force",
  "issued_date": "2018-06-08",
  "in_force_date": "2018-06-16",
  "url": "https://www.nn.hr/clanci/sluzbeni/2018_54_1089.html",
  "description": "Croatia's legislation on the protection of trade secrets, transposing Directive (EU) 2016/943 on the protection of undisclosed know-how and business information (trade secrets) against their unlawful acquisition, use, and disclosure.",
  "provisions": [
    {
      "provision_ref": "art1",
      "section": "1",
      "title": "Article 1 – Subject matter",
      "content": "This Act lays down rules on the protection against the unlawful acquisition, use, and disclosure of trade secrets, implementing Directive (EU) 2016/943 of the European Parliament and of the Council of 8 June 2016 on the protection of undisclosed know-how and business information (trade secrets) against their unlawful acquisition, use, and disclosure."
    },
    {
      "provision_ref": "art2",
      "section": "2",
      "title": "Article 2 – Definitions",
      "content": "For the purposes of this Act: (1) 'trade secret' means information which: (a) is secret in the sense that it is not, as a body or in the precise configuration and assembly of its components, generally known among or readily accessible to persons within the circles that normally deal with the kind of information in question; (b) has commercial value because it is secret; (c) has been subject to reasonable steps by the person lawfully in control of the information to keep it secret; (2) 'trade secret holder' means any natural or legal person lawfully controlling a trade secret; (3) 'infringer' means any natural or legal person who has unlawfully acquired, used, or disclosed a trade secret."
    },
    {
      "provision_ref": "art3",
      "section": "3",
      "title": "Article 3 – Lawful acquisition of trade secrets",
      "content": "The acquisition of a trade secret shall be considered lawful when obtained by: (1) independent discovery or creation; (2) observation, study, disassembly, or testing of a product or object that has been made publicly available or is lawfully in the possession of the acquirer; (3) exercise of the right of workers or workers' representatives to information and consultation in accordance with labour law; (4) any other practice which, under the circumstances, is in conformity with honest commercial practices."
    },
    {
      "provision_ref": "art4",
      "section": "4",
      "title": "Article 4 – Unlawful acquisition",
      "content": "The acquisition of a trade secret without the consent of the trade secret holder shall be considered unlawful where carried out by: (1) unauthorised access to, appropriation of, or copying of any documents, objects, materials, substances, or electronic files, lawfully under the control of the trade secret holder, containing the trade secret or from which the trade secret can be deduced; (2) any other conduct which, under the circumstances, is considered contrary to honest commercial practices."
    },
    {
      "provision_ref": "art5",
      "section": "5",
      "title": "Article 5 – Unlawful use and disclosure",
      "content": "The use or disclosure of a trade secret shall be considered unlawful where carried out without the consent of the trade secret holder by a person who: (1) has acquired the trade secret unlawfully; (2) is in breach of a confidentiality agreement or any other duty not to disclose the trade secret; (3) is in breach of a contractual or other duty to limit the use of the trade secret. The production, offering, or placing on the market of infringing goods, or the importation, export, or storage of infringing goods for those purposes, shall also be considered an unlawful use of a trade secret."
    },
    {
      "provision_ref": "art6",
      "section": "6",
      "title": "Article 6 – Exceptions",
      "content": "The acquisition, use, or disclosure of a trade secret shall be considered lawful to the extent required or permitted by Union or national law, including: (1) for exercising the right to freedom of expression and information; (2) for revealing misconduct, wrongdoing, or illegal activity (whistleblowing), provided that the person acted for the purpose of protecting the general public interest; (3) for the protection of a legitimate interest recognised by Union or national law."
    },
    {
      "provision_ref": "art7",
      "section": "7",
      "title": "Article 7 – Whistleblower protection",
      "content": "The protection of trade secrets shall not limit the rights of whistleblowers under the Whistleblower Protection Act (NN 46/22) or Directive (EU) 2019/1937. A person who acquires, uses, or discloses a trade secret for the purpose of revealing misconduct, wrongdoing, or illegal activity shall not be liable under this Act, provided that the disclosure was necessary and proportionate for the protection of the general public interest."
    },
    {
      "provision_ref": "art8",
      "section": "8",
      "title": "Article 8 – Limitation period",
      "content": "Proceedings for the measures, procedures, and remedies provided for in this Act shall be subject to a limitation period of three years from the date on which the trade secret holder became aware or had reason to become aware of the unlawful acquisition, use, or disclosure of the trade secret and the identity of the infringer. The limitation period shall be suspended by any act of the trade secret holder seeking enforcement of the claim."
    },
    {
      "provision_ref": "art9",
      "section": "9",
      "title": "Article 9 – Preservation of confidentiality during proceedings",
      "content": "Courts shall, on a reasoned request of a party, take specific measures necessary to preserve the confidentiality of any trade secret or alleged trade secret used or referred to in the course of legal proceedings. Such measures may include: (1) restricting access to documents containing trade secrets to a limited number of persons; (2) restricting access to hearings and recordings; (3) making available a non-confidential version of judicial decisions with passages containing trade secrets removed or redacted."
    },
    {
      "provision_ref": "art10",
      "section": "10",
      "title": "Article 10 – Provisional and precautionary measures",
      "content": "The court may order provisional and precautionary measures against the alleged infringer, including: (1) the cessation of, or prohibition against, the use or disclosure of the trade secret on a provisional basis; (2) the prohibition of the production, offering, placing on the market, or use of infringing goods; (3) the seizure or delivery up of the suspected infringing goods; (4) the provision of an appropriate amount as security for the compensation of the trade secret holder."
    },
    {
      "provision_ref": "art11",
      "section": "11",
      "title": "Article 11 – Injunctions and corrective measures",
      "content": "Where the court finds that a trade secret has been unlawfully acquired, used, or disclosed, it may order: (1) the cessation of, or prohibition against, the use or disclosure of the trade secret; (2) the prohibition of the production, offering, placing on the market, or use of infringing goods; (3) the destruction of all or part of any document, object, material, substance, or electronic file containing or embodying the trade secret; (4) the recall of infringing goods from the market."
    },
    {
      "provision_ref": "art12",
      "section": "12",
      "title": "Article 12 – Damages",
      "content": "The trade secret holder shall be entitled to compensation for the damage actually suffered as a result of the unlawful acquisition, use, or disclosure of the trade secret. When setting damages, the court shall take into account: (1) the negative economic consequences, including lost profits; (2) any unfair profits made by the infringer; (3) the moral prejudice caused to the trade secret holder. As an alternative, the court may set the damages as a lump sum based on the amount of royalties or fees which would have been due had the infringer requested authorisation to use the trade secret."
    },
    {
      "provision_ref": "art13",
      "section": "13",
      "title": "Article 13 – Publication of judicial decisions",
      "content": "The court may order, at the request of the trade secret holder, appropriate measures for the dissemination of information concerning the judgment, including publishing the judgment in full or in part. The cost of publication shall be borne by the infringer. Publication measures shall respect the confidentiality of trade secrets."
    },
    {
      "provision_ref": "art14",
      "section": "14",
      "title": "Article 14 – Safeguards for employees",
      "content": "This Act shall not limit the mobility of employees. In particular, this Act shall not offer any ground for: (1) limiting employees' use of experience and skills honestly acquired in the normal course of their employment; (2) imposing any additional restrictions on employees in their employment contracts other than those imposed in accordance with labour law."
    },
    {
      "provision_ref": "art15",
      "section": "15",
      "title": "Article 15 – Safeguards against abusive litigation",
      "content": "Where proceedings are initiated abusively or in bad faith, or where the applicant is found to have acted in bad faith, the court may: (1) impose sanctions on the applicant; (2) order the applicant to compensate the defendant for any damage suffered; (3) order the dissemination of information concerning the abusive proceedings."
    },
    {
      "provision_ref": "art16",
      "section": "16",
      "title": "Article 16 – Exchange of information between authorities",
      "content": "The competent authorities of the Republic of Croatia shall exchange information relevant to the enforcement of this Act with the competent authorities of other EU Member States, in accordance with Directive (EU) 2016/943. Such exchange shall be carried out through the contact points designated by the Member States."
    },
    {
      "provision_ref": "art17",
      "section": "17",
      "title": "Article 17 – Relationship with other legislation",
      "content": "This Act is without prejudice to the application of: (1) the Unfair Competition Prevention Act; (2) intellectual property laws, including patent, trademark, and copyright law; (3) the Criminal Code, in so far as it provides for criminal penalties for the unlawful acquisition or disclosure of trade secrets; (4) the Obligations Act, in so far as it regulates contractual obligations of confidentiality."
    },
    {
      "provision_ref": "art18",
      "section": "18",
      "title": "Article 18 – Competent courts",
      "content": "Actions under this Act shall be brought before the Commercial Court (Trgovački sud) having jurisdiction over the domicile or seat of the defendant. Where the defendant has no domicile or seat in the Republic of Croatia, the action shall be brought before the Commercial Court in Zagreb."
    },
    {
      "provision_ref": "art19",
      "section": "19",
      "title": "Article 19 – Transitional provisions",
      "content": "This Act shall apply to acts of unlawful acquisition, use, or disclosure of trade secrets that occur after its entry into force. Proceedings initiated under the prior legislation before the entry into force of this Act shall be concluded in accordance with the prior legislation."
    },
    {
      "provision_ref": "art20",
      "section": "20",
      "title": "Article 20 – Entry into force",
      "content": "This Act shall enter into force on the eighth day after its publication in the Official Gazette (Narodne novine)."
    }
  ],
  "definitions": [
    {
      "term": "trade secret",
      "definition": "Information which is secret, has commercial value because it is secret, and has been subject to reasonable steps to keep it secret, as defined in Article 2(1) of Directive (EU) 2016/943.",
      "source_provision": "art2"
    },
    {
      "term": "trade secret holder",
      "definition": "Any natural or legal person lawfully controlling a trade secret.",
      "source_provision": "art2"
    },
    {
      "term": "infringer",
      "definition": "Any natural or legal person who has unlawfully acquired, used, or disclosed a trade secret within the meaning of this Act.",
      "source_provision": "art2"
    },
    {
      "term": "infringing goods",
      "definition": "Goods the design, characteristics, functioning, production process, or marketing of which significantly benefits from trade secrets unlawfully acquired, used, or disclosed.",
      "source_provision": "art5"
    }
  ]
}
